In [36]:
#Base de datos Titanic
import pandas as pd
import numpy as np
url="https://drive.google.com/uc?export=download&id=19yNKOtKt_bUZa8eNr5dKpoLE7lVVoIeO"
titanic=pd.read_csv(url)
titanic.head()
titanic.info()
titanic.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

(891, 12)

1.PRIMERA LIMPIEZA DE DATOS: [CABIN]

In [37]:
titanic['TieneCabina'] = titanic['Cabin'].notna().astype(int)
titanic = titanic.drop('Cabin', axis=1)

titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,TieneCabina
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,0

Limpieza de dato age * nueva columna : se crea una nueva columna con los datos de el titulo incluido en el nombre para incluir valor , se recogen los titulos y se promedian las edades para rellenar valores nulos en la edad.

In [38]:
# 1) Extraer el título usando expresión regular
titanic['Title'] = titanic['Name'].str.extract(r',\s*([^.]*)\.')

# 2) (Opcional) limpiar el punto final si deseas títulos sin punto
# En este método ya salen sin punto, pero si quieres asegurarlo:
titanic['Title'] = titanic['Title'].str.strip()

# 3) Ver las primeras filas para verificar
print(titanic[['Name', 'Title']].head())

# 4) Ver los títulos únicos que aparecen en el dataset
print(titanic['Title'].unique())

print (titanic.head)

                                                Name Title
0                            Braund, Mr. Owen Harris    Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...   Mrs
2                             Heikkinen, Miss. Laina  Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)   Mrs
4                           Allen, Mr. William Henry    Mr
['Mr' 'Mrs' 'Miss' 'Master' 'Don' 'Rev' 'Dr' 'Mme' 'Ms' 'Major' 'Lady'
 'Sir' 'Mlle' 'Col' 'Capt' 'the Countess' 'Jonkheer']
<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Embarked  TieneCabina Title
0        0         A/5 21171   7.2500        S            0    Mr
1        0          PC 17599  71.2833        C            1   Mrs
2        0  STON/O2. 3101282   7.9250        S            0  Miss
3        0            113803  53.1000        S            1   Mrs
4        0            373450   8.0500        S            0    Mr
..     ...               ...      ...      ...          ...   ...
886      0            211536  13.0000        S            0   Rev
887      0            112053  30.0000        S            1  Miss
888      2        W./C. 6607  23.4500        S            0  Miss
889      0            111369  30.0000        C            1    Mr
890      0            370376   7.7500        Q            0    Mr

[891 rows x 13 columns]>

In [39]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,TieneCabina,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,0,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,0,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,1,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,S,0,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,1,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,0,Mr

In [42]:

titanic.loc[(titanic['Title'] == 'Master') & (titanic['Age'] > 18), 'Age'] = np.nan


promedioedad = titanic.groupby('Title')['Age'].mean()

# 3) Rellenar los valores faltantes usando ese promedio
titanic['Age'] = titanic['Age'].fillna(titanic['Title'].map(promedioedad))

# 4) Verifica los cambios
print(titanic[['Title', 'Age']].head())
print(titanic['Age'].isnull().sum())

  Title   Age
0    Mr  22.0
1   Mrs  38.0
2  Miss  26.0
3   Mrs  35.0
4    Mr  35.0
0

In [41]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
 11  TieneCabina  891 non-null    int64
 12  Title        891 non-null    object
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [44]:
titanic.to_csv("titanic_limpio.csv", index=False)